# Question 1

In order to progrem a function that changes the base, let us use the build in functions:
1. bin()
2. oct()
3. hex()

then define a function that changes the base by the base the user want to change to.

In [306]:
# Function to convert decimal to binary 
def decimal_to_binary(dec): 
    decimal = int(dec) 
    # Prints equivalent decimal 
    print(decimal, " in Binary : ", bin(decimal)) 
    
# Function to convert decimal to octal 
def decimal_to_octal(dec): 
    decimal = int(dec)   
    # Prints equivalent decimal 
    print(decimal, "in Octal : ", oct(decimal))  
    
# Function to convert decimal to hexadecimal 
def decimal_to_hexadecimal(dec): 
    decimal = int(dec)   
    # Prints equivalent decimal 
    print(decimal, " in Hexadecimal : ", hex(decimal)) 
    
def change_base(dec, base):
    if base == 2:
        return decimal_to_binary(dec)
    elif base == 8:
        return decimal_to_octal(dec)
    elif base == 16:
        return decimal_to_hexadecimal(dec)
    else:
        return "Please choose base 2/8/16"
#tests:   
change_base(20, 2)
change_base(20, 8)
change_base(20, 16)
change_base(20, 3)

20  in Binary :  0b10100
20 in Octal :  0o24
20  in Hexadecimal :  0x14

'Please choose base 2/8/16'

# Question 2
### Q1
Importing the data:

In [5]:
import pandas as pd
cast = pd.read_csv(r'C:\Users\talia\OneDrive\שולחן העבודה\מבוא למדעי הנתונים\cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

First let us get the all the locations of the Helmet movies, then let us remove all the duplicate places that are from the same year, then count all the movies.

In [56]:
h = cast.loc[cast['title'] == 'Hamlet']
h = h.drop_duplicates(subset = 'year', keep = 'first')
h.count()
#17 movies have the title "Hamlet"

title        17
year         17
name         17
type         17
character    17
n            12
dtype: int64

# Question 2
### Q2

First let us get the all the locations of the Treasure Island movies, then let us remove all the duplicate places that are from the same year, then sort the years of the movies.

In [52]:
t = cast.loc[cast['title'] == 'Treasure Island']
t = t.drop_duplicates(subset = 'year', keep = 'first')
t = t.sort_values('year', ascending = True)
t

,title,year,name,type,character,n
313097,Treasure Island,1918,Francis Carpenter,actor,Jim Hawkins,1.0
345942,Treasure Island,1920,Lon Chaney,actor,Blind Pew,5.0
8570,Treasure Island,1934,Robert Adair,actor,Tom - Seaman,NaN
12141,Treasure Island,1950,Chris Adcock,actor,Pike,26.0
38151,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,18.0
484325,Treasure Island,1973,Richard Dawson,actor,Long John Silver,1.0
14899,Treasure Island,1985,Yves Afonso,actor,French captain,8.0
104905,Treasure Island,1999,Lance (II) Baker,actor,Frank,1.0

# Question 2
### Q3

Let us get all the movies of Hamlet information, then just the one from 1921, and count all the roles.

In [62]:
actor = cast.loc[cast['title'] == 'Hamlet']
actor = actor.loc[actor['year'] == 1921]
actor.count()
#9 roles were credited in the silent 1921 version of Hamlet

title        9
year         9
name         9
type         9
character    9
n            9
dtype: int64

# Question 2
### Q4

Let us get the decades by divide the years by 100, then using the same variable h (which we defined in Q1) and get the size to get the number of "Hamlet" films made in those years.

In [330]:
hamlet_years_group =h.groupby(h['year']//10*10)
t = hamlet_years_group.size()
t

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    2
dtype: int64

# Question 2
### Q5

First let us get the leading roles list, then specifically the years 1950 - 1959.
Then we define the actors and actresses leading lists, and by the function groupby we group the lists by the years, then convert them into data frames.

In [168]:
leading_roles = cast.loc[cast['n']==1]
years = leading_roles.loc[leading_roles['year']>=1950].loc[leading_roles['year']<1960]
actors = years.loc[years['type'] == 'actor']
actress = years.loc[years['type'] == 'actress']
#groupby the actors and the actresses locations by years
actors_group = actors.groupby('year').size()
actress_group = actress.groupby('year').size()
df1 = pd.DataFrame(actors_group)
df2 = pd.DataFrame(actress_group)
frames = [df1, df2]
result = pd.concat(frames , axis = 1)
result.columns = ['actor', 'actress']
result

      actor  actress
year
1950    604      271
1951    633      272
1952    591      284
1953    634      290
1954    626      298
1955    606      264
1956    614      288
1957    708      284
1958    694      275
1959    678      287

# Question 2
### Q6

First we locate all the leading roles in the years since 1990, then get the names of the actors/actresses and set them acording to thier number of roles, then get the first ten.

In [182]:
years1 = leading_roles.loc[leading_roles1['year']>=1990]
years1 = years1['name'].value_counts().head(10)
df = pd.DataFrame(years1)
df

                    name
Mohanlal             126
Mammootty            118
Akshay Kumar          87
Jayaram               76
Andy Lau              72
Ajay Devgn            69
Amitabh Bachchan      68
Eric Roberts          68
Nagarjuna Akkineni    60
Dilip                 59

# Question 2
### Q7

Let us locate every movie that he was in, then let us sort the years. 
After that we get all the roles he had in the movies, and finaly show only the ones he had more than one role.

In [335]:
frank_oz = cast.loc[cast['name'] == 'Frank Oz']
frank_oz = frank_oz.sort_values('year')
frank_oz = frank_oz.groupby(['year','title']).size()
frank_oz = frank_oz[frank_oz > 1]
df3 = pd.DataFrame(frank_oz)
df3

                                               0
year title
1979 The Muppet Movie                          8
1981 An American Werewolf in London            2
     The Great Muppet Caper                    6
1982 The Dark Crystal                          2
1984 The Muppets Take Manhattan                7
1985 Sesame Street Presents: Follow that Bird  3
1992 The Muppet Christmas Carol                7
1996 Muppet Treasure Island                    4
1999 Muppets from Space                        4
     The Adventures of Elmo in Grouchland      3